const appDescription = {
  header: 'Назначение приложения',
  description: `Данное приложение служит для повышения уровня владения английским языком посредством расширения вашего вокабуляра.
                Используя его, вы можете изучить порядка 3600 популярных слов английского языка.
                Играйте в мини игры или заполняйте карточки  и следите за своим прогрессом с помощью статистики.
                Вы так же можете настроить приложение под себя с помощью настроек, тем самым ваше обучение будет максимально комфортным
                и эффективным.
                Ниже приведены некоторые описания разделов приложения, ознакомившись с которыми, вы можете ответить на некоторые 
                на некоторые свои вопросы.`,
};

const mainDescription = {
  header: 'Описание главной страницы',
  description: `Главная страница отображает ваш прогресс по дням недели, новые слова, лучшую серию слов,
                пройденных слов, слова для практики.
                На главной странице вы можете видеть общую картину ваших результатов и ваших целей,
                это значит что вы будите всегда иметь ориентир в обучении`,
};

const settingsDescription = {
  header: 'Настройки приложения',
  description: `C помощью настроек вы можете адаптировать изучение новых слов на свое усмотрение и 
  сделать изучение максимально комфортным: вы можете установить количество изучаемых
  слов в день, так же можно установить количество карточек для изучения на 1 день.
  И еще некоторые надстройки которые помогу разнообразить ваше обучение`,
};

const learnWordsDescription = {
  header: 'Изучение новых слов',
  description: `Для изумения и закрепления изученных слов, вам предлагается использовать карточки.
                Карточка содержит в себе картинку, транскрипцию, и пердложение с предполагаемым
                словом на иностранном языке. Ваша задача угадать это слово. Если для вас это слово
                оказалось слишком легким, вы можете убрать его из списка изучаемых. Или же пометить
                его как сложное.`,
};

const statisticPageDescription = {
  header: 'Статистика изученных слов',
  description: 'some description',
};

const miniGamesDescription = {
  header: 'Мини-игры',
  description: `Тренировать слова вы так же можете с помощью мини-игр. Вам пердоставлены 6 мини-игр:
                'Аудиовызов', 'Саванна', 'Конструктор слов', 'Спринт', 'Пазл', 'Speak It'.
                С ними вы сделаете процесс ващего обучение более разнообразным, интерактивным и
                интересным. Благодаря разнообразию игр вы можете повышать все навыки владения
                иностранным языком.`,
  AUDIO_CALL: {
    header: 'Мини-игры: Аудиовызов',
    description: `"Аудиовызов" - игра которая поможет вам развить навык восприятия иностранного языка на слух.
                  Звучит слово на английском языке, нужно выбрать
                  перевод слова из пяти предложенных вариантов ответа.
                  В игре представлено 6 уровней сложности по 60 раундов в каждом уровне.
                  Каждый раунд содержит по 10 слов для угадывания. Слово необходимо угадать 
                  из 5 похожих по написанию и/или одной части речи слов.`,
  },
  ENGLISH_PUZZLE: {
    header: 'Мини-игры: Паззл',
    description: `"Паззл" - игра которая поможет вам научиться воспринимать на слух английскую
                  речь и научиться правильно составлять слова в предложения.
                  В игре представлено 6 уровней сложности.
                  Вам нужно подтянуть или кликая по словам внизу экрана переместить их в
                  нужном порядке в поля перевода слова.`,
  },
  SPEAKIT: {
    header: 'Мини-игры: "Speak It"',
    description: `"Speak It" - игра предназначена для тренировки тренировки восприятия
                  английских слов на слух и их произношения.
                  В игре 6 уровней сложностию. Для игры вам понадобится миктофон.`,
  },
  SAVANNAH: {
    header: 'Мини-игры: Саванна',
    description: `"Саванна": если вы хотите проверить свой словарный запас, то можете поиграть в эту мини игру.
                  Вам дается английское слово и и варианты перевода слова, 
                  за определенный отрезок времени нужно указать перевод данного слова. 
                  Всего за раунд нужно угадать 10 слов.
                  В "Cаванне" представлено 6 уровней сложности`,
  },
  SPRINT: {
    header: 'Мини-игры: Спринт',
    description: `"Спринт" - игра которая проверит ваш словарный запас иностранных слов.
                  Ваша задача в том, чтобы за отведенное вам время угадать как можно больше правильно
                  переведенных слов. Данная игра поможет вам научиться реагировать на слова или текст
                  В игре представлено 6 уровней сложности.`,
  },
  WORD_BUILDER: {
    header: 'Мини-игры: Конструктор слов',
    description: `"Контруктор слов" - игра для запоминания правильного написания иностранных слов.
                  Вам дается перевод слова, и по переводу вам необходимо составить слово на иностранном
                  языке. Эта игра поможет запомнить или вспонить написание иностранных слов`,
  },
};

export {
  miniGamesDescription,
  appDescription,
  settingsDescription,
  learnWordsDescription,
  statisticPageDescription,
  mainDescription,
};
