const AUDIOCALL_HELP = [
  `Ход игры: звучит произношение слова на английском языке, нужно выбрать
    перевод слова из пяти предложенных вариантов ответа.`,
  `В игре представлено 6 уровней сложности по 60 раундов в каждом уровне.
    Выбор уровня сложности и раунда находится в правом верхнем углу.`,
  `Cлова можно угадывать выбирая их как кликами мышкой,
    так и нажатием кнопок клавиатуры. 
    "Клавиша 1" - первое слово, "Клавиша 2" - второе, и так до 5. 
    Выбот ответ "Не знаю" и переход к следующему вопросу происходит 
    как при клике по кнопке "Далее", так и нажатием клавиши Enter.`,
  `В левом нижнем углу экрана находится регулировка звука произношения слово во время игры. 
    Регулировка применятеся от 0% до 100% с шагом в 5%.`,
];

const SPRINT_HELP = [

];

const SPEAKIT_HELP = [

];

export { AUDIOCALL_HELP, SPRINT_HELP, SPEAKIT_HELP };
